{
  "_class_name": "FluxTransformer2DModel",
  "_diffusers_version": "0.30.0",
  "in_channels": 64,
  "num_layers": 19,
  "num_single_layers": 38,
  "attention_head_dim": 128,
  "num_attention_heads": 24,
  "joint_attention_dim": 4096,
  "pooled_projection_dim": 768,
  "guidance_embeds": true,
  "axes_dims_rope": [16, 56, 56],
  "patch_size": 1
}
